Cats/app/views/cat_rental_requests/index.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 ORDER BY "cats"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <td>
            <%= Cat.where(id: kitten.cat_id).first.name %>