Cats/app/views/cat_rental_requests/new.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
        <option disabled selected>--Please Select--</option>
        <% CatRentalRequest.all.each do |req| %>