Cats/app/controllers/cat_rental_requests_controller.rb

    def index
        @kitty = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

    def show
        @kitty = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
        @kitty = CatRentalRequest.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def approve
        @kitty = CatRentalRequest.find(params[:id])
        if @kitty.update(status: 'APPROVED')
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2019-08-03 22:40:44.261167"], ["id", 3]]

    def create
        @kitty = CatRentalRequest.new(cat_rental_request_params)
        if @kitty.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2019-11-01"], ["end_date", "2019-11-30"], ["created_at", "2019-08-03 21:34:17.047077"], ["updated_at", "2019-08-03 21:34:17.047077"]]