Cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @kitties = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @kitty = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @kitty = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "white"], ["description", "            TayTay is super cool and definitely awesome. He WILL be your BFF.\r\n\r\n\r\n"], ["updated_at", "2019-08-02 22:08:47.221132"], ["id", 3]]
---
    def update
        @kitty = Cat.find(params[:id])
        if @kitty.update(cat_params)

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @kitty = Cat.new(cat_params)
        if @kitty.save